#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiapSoat3-G35/postech-fase-4-pagamento-db/runs/run-KkmB9qY25m2zvygk

Waiting for the plan to start...

Terraform v1.7.5
on linux_amd64
Initializing plugins and modules...
aws_dynamodb_table.first_table: Refreshing state... [id=Demo-first-table]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_dynamodb_table.first_table will be destroyed
  # (because aws_dynamodb_table.first_table is not in configuration)
  - resource "aws_dynamodb_table" "first_table" {
      - arn              = "arn:aws:dynamodb:us-east-1:471112887467:table/Demo-first-table" -> null
      - billing_mode     = "PAY_PER_REQUEST" -> null
      - hash_key         = "employee-id" -> null
      - id               = "Demo-first-table" -> null
      - name             = "Demo-first-table" -> null
      - read_capacity    = 0 -> null
      - stream_enabled   = false -> null
      - tags             = {
          - "environment" = "demo"
        } -> null
      - write_capacity   = 0 -> null
        # (3 unchanged attributes hidden)

      - attribute {
          - name = "employee-id" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled        = false -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_dynamodb_table.pagamento will be created
  + resource "aws_dynamodb_table" "pagamento" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "pagamento-id"
      + id               = (known after apply)
      + name             = "pagamento-service-table"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "environment" = "g35"
        }

      + attribute {
          + name = "pagamento-id"
          + type = "S"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - subnet_cidr_blocks = [
      - "10.0.3.0/24",
      - "10.0.2.0/24",
      - "10.0.4.0/24",
      - "10.0.6.0/24",
      - "10.0.1.0/24",
      - "10.0.5.0/24",
    ] -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @alinedonatoc, Action: `pull_request`*